theory/api/soap/req-body.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<getOrderDetails xmlns="https://example-store.com/orders">
			<orderID>42</orderID>
		</getOrderDetails>
	</soap:Body>
</soap:Envelope>